[{"code": "1001", "title": "The Beauty of Kunqu Opera", "career": "Undergraduate", "units": "2.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course introduces students to the music, performance, literature and aesthetics of Kunqu opera in order to enhance their understanding of traditional Chinese culture, classical Chinese literature as well as performing arts. Selected scenes from Kunqu classics, such as The Peony Pavilion and The Palace of Eternal Youth will be analyzed and discussed before they are staged for appreciation. Under the teachers’ guidance, students will be able to experience the unity of song and dance as well as the artistic expression of emotions in the world of Kunqu opera.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1002", "title": "From Tradition to Modernity: Selected Readings of 20th Century Chinese Culture", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "The course is designed as a sequel to ARTS1000 (Classics of Chinese Humanities: Selected Readings) by focusing on a number of representative texts by famous Chinese intellectuals and writers. They bear witness to the mental deliberations of a generation—or two generations—caught between the forces of tradition and modernity as they found their way through the thicket of source materials from both Chinese and Western cultural traditions. Each author chooses to confront the legacies of Chinese tradition—literary, cultural, and intellectual—by subjecting them to a new reevaluation from modern perspectives derived from their newly acquired knowledge and/or experience from the West. Their modes of analysis have set a new intellectual and scholarly benchmark for later generations. In short, these texts have become modern “classics” in their own right.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1003", "title": "Introduction to Chinese Classics", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course aims at illustrating the relationship between Chinese classics texts and Chinese culture. Through discussions of important texts in Confucianism, Daoism and Buddhism, students can gain a deeper understanding of these philosophical schools and the underlying features of Chinese tradition, beliefs and values.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1005", "title": "Introduction to Music and Philosophy", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Classwork\nDiscussion\nLecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course introduces music and philosophy as intersecting practices through which human beings give meaning to the world around them. By exploring philosophy through music and music through philosophy from cross-cultural perspectives, the course exposes students to a variety of ways that knowledge, existence, religion, ethics, politics, culture, and sound converge.Rather than a comprehensive introduction to the fields of philosophy and music, this course uses a topical approach to explore several themes in these fields through discussion of selected musical examples and readings presented within an interdisciplinary framework. No background in music or philosophy is assumed or required.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "1007", "title": "Creative Cities and Urban Cultural Life", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "Creative economy and cultural industries have been considered crucial strategies for driving the urban development of global cities. The dynamic landscape of the global cultural scene, where culture converges with the economy, community, heritage, and innovative technologies, has created an impetus for many cities to adopt innovative approaches in utilising urban spaces and cultural resources, enabling citizens to vividly reimagine their urban and cultural life. These approaches are envisioned as and manifested in the form of the development of large-scale urban regions and city clusters, where major cultural facilities such as museums, art districts, performance venues, and festivals significantly contribute to social well-being and intercultural dialogue.This course is designed to provide students with an opportunity to explore the interface between culture, urban space, and the economy with an eye towards the radically changing cultural landscape of Hong Kong. By offering students both theoretical knowledge and firsthand field experience, this course examines museums, galleries, and various cultural institutions as exemplary cases of how different forms of cultural activities can be turned into powerhouses of creative synergies and economic growth. By the end of the course, students will have gained insight into the complex relationships between the emerging phenomenon of creative cities and urban cultural life, as well as heritage and Chinese culture.", "outcome": " Explain and apply interdisciplinary approaches that help understand the basic concepts of creative cities. Foster critical analysis skills for assessing cultural contexts that promote urban creativity. Cultivate an attitude of innovation and creativity to challenge assumptions in the expanding fields of urban studies and culture. Present case studies and produce creative works that demonstrate students' perspectives when examining Hong Kong as a creative city.", "syllabus": "Section I: Understanding Creative City and Culture-Led Urban Development 1. What is a Creative City? The Definition of Culture-Led Urban Development This session introduces Hong Kong as a creative city and includes a workshop on approaches to city exploration. It delves into field study and creative skills for interpreting the intricacies of the city. Additionally, it involves a discussion of assignments and scheduling for the field trips.2. Contextualizing Creative Cities: A Global PerspectiveThis session delves into theories of creative cities, investigating how urban environments evolve as cultural constructs. It will provide students with historical contexts from both Western and Asian perspectives. The aim is to equip students, regardless of their backgrounds, with the foundational knowledge necessary for engaging in critical discussions on the subjects of creative cities.3. The Current Cultural Policy in Hong Kong and BeyondThis session explores how cultural policies play a pivotal role in facilitating culture-led urban development. By referencing both local and international cultural policies and examining the latest trends in cultural development and cultural tourism, students will gain insights into how policies influence the daily lives of both citizens and tourists.4. Locating Creative Industries in Hong KongThis session introduces how creative industries serve as a crucial role for economic growth. Students will explore various case studies in Hong Kong as contributors toeconomic value through creativity. In Hong Kong, creative industries are thriving, and this session will offer students an array of examples from Hong Kong and beyond.Section II: Special Topics in Creative Cities1. Museums and Art Districts as Flagship IconsThis session delves into the role of museums and art districts as representations of city flagships or icons. It will cover how storytelling, innovative museum interpretations, and immersive interactive technologies can unlock creative potential, promote public wellbeing, and articulate shared values in everyday life.2. Unveiling Public Art in Vibrant Hong KongThis session covers critical artistic practices that capture urban changes, utilizing the city and urban space as a medium to reflect modern life, architecture, and creative urban environments. Topics include Hong Kong artists creatively interpreting Hong Kong.3. Heritage Reimagined: Cultivating Dynamic Creative HubsThis session studies how cities use heritage preservation as a strategy to build a cultural identity. It will also examine examples of art districts that repurpose old structures to transform remnants of the industrial past into new creative hubs, including place-making projects that intertwine a city's history and tangible and intangible culture.4. Engaging Communities CreativelyThis session explores the role that communities play in shaping creativity and enriching urban experiences. In Hong Kong, there is a growing interest in community-led artistic initiatives, and this session will provide students with a diverse range of examples to study.5. Digital Horizons: Media and Technology Shaping the Urban LandscapeThis session delves into the role of media and technology in shaping the social production of urban spaces. In Hong Kong, the intersection of art, technology, and theconcept of a \"smart city\" has become a key government initiative. This session will provide students with valuable insights into how sustainable urban development is being integrated with cutting-edge technologies and networks.", "required_readings": "Certeau, Michel De. \"General Introduction.\" In The Practice of Everyday Life. University of California Press, Berkeley, US, 2011, pp. xi-xxiv.Hutton, Thomas A. \"Introduction - Cities, the Cultural Economy and Urban Studies.\" In Cities and the Cultural Economy. Routledge, Abingdon, UK, 2016, pp. 1-33.Jonas, Andrew E. G., et al. \"Approaching the City.\" In Urban Geography: A Critical Introduction. John Wiley & Sons, Chichester, UK, 2015, pp. 1-26.Lefebvre, Henri. \"From the City to Urban Society.\" In The Urban Revolution. University of Minnesota Press, Minneapolis, US, 2011, pp. 1-22.Smith, Neil. \"New Globalism, New Urbanism: Gentrification as Global Urban Strategy.\" Antipode, vol. 34, no. 3, July 2002, pp. 427-450. https://doi.org/10.1111/1467-8330.00249.", "recommended_readings": "", "terms": {"2024-25 Summer Session": {"--LEC (1554)": {"startTimes": ["9:30", "9:30", "9:30", "9:30", "9:30"], "endTimes": ["12:15", "12:15", "12:15", "12:15", "12:15"], "days": [2, 3, 4, 5, 1], "locations": ["Wu Ho Man Yuen Bldg 403", "Wu Ho Man Yuen Bldg 403", "Wu Ho Man Yuen Bldg 403", "Wu Ho Man Yuen Bldg 403", "Wu Ho Man Yuen Bldg 403"], "instructors": ["Professor LEUNG Hok Bun Isaac", "Professor LEUNG Hok Bun Isaac", "Professor LEUNG Hok Bun Isaac", "Professor LEUNG Hok Bun Isaac", "Professor LEUNG Hok Bun Isaac"], "meetingDates": ["25/6", "26/6", "27/6", "2/7", "3/7", "8/7", "9/7", "10/7", "15/7", "16/7", "17/7", "22/7", "23/7", "24/7", "28/7"]}}}, "assessments": {"Classwork": "20", "Presentation": "20", "Project": "40", "Participation": "20"}}, {"code": "1008", "title": "Take on Hong Kong: The Revitalisation and Interpretation of Hong Kong's Cultural Heritage", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Field Studies/Field-trip\nLecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course explores cultural heritage definitions and relevant conceptualisations in the local context. It introduces the historical development of cultural heritage in the contemporary world. It then further discusses the current legal and policy framework of local heritage selection and conservation. It requires the students to reflect on what heritage is and how heritage shall be selected and defined. Through various local case studies, students will explore the social relation between cultural heritage and the local community. They will debate how cultural heritage shall be interpreted from a local perspective but could be operated sustainably.", "outcome": " Students will understand the basic concepts of cultural heritage. Students will briefly understand the current cultural heritage conservation policy development in Hong Kong. Students will know how cultural heritage could be connected with the local community. Students will understand the importance of cultural heritage conservation and the diversity of cultural heritage interpretation.  ", "syllabus": "Section 1: Concepts and theories related to cultural heritage and museum The concepts and definitions of cultural heritage and its historical evolution.International conventions related to heritage conservation and management.The development of Hong Kong's public and private museums and their social roles in education and public engagement in the context of Hong Kong. Section 2: The historical evolution of the historical structures conservation system in Hong Kong  The transformation of Hong Kong’s conservation system of historic structures. The social functions of cultural heritage: the challenges and opportunities of revitalising Hong Kong’s historic structures. Cultural heritage and the construction of local communities: the reuse and revitalisation of cultural heritage and its social connection with local communities. The conservation and sustainable inheritance of Hong Kong's intangible cultural heritage.", "required_readings": "Barber, L. (2014). (Re)Making Heritage Policy in Hong Kong: A Relational Politics of Global Knowledge and Local Innovation. Urban Studies (Edinburgh, Scotland), 51(6), 1179–1195.Cheung. W..L. (2009). Urban transformation of Central District : as a place of living. Conservancy Association Centre for Heritage.Henderson, J. C. (2008). Conserving Hong Kong’s Heritage: The Case of Queen’s Pier. International Journal of Heritage Studies : IJHS, 14(6), 540–554.Ho, E. (2022). Heterotopic Heritage in Hong Kong: Tai Kwun and Neo-Victorian Carceral Space. Humanities (Basel), 11(1), 12.Lu, T. L. -. (2009). Heritage conservation in postcolonial Hong Kong. International Journal of Heritage Studies, 15(2), 258-272. Lu, T. L.-D. (2016). Empowerment, transformation and the construction of “urban heritage” in post-colonial Hong Kong. International Journal of Heritage Studies : IJHS, 22(4), 325–335. Nicolson, K. (2016). Landscapes lost and found : appreciating Hong Kong’s heritage cultural landscapes. Hong Kong University Press.Foster, M. D., & Gilman, L. (2015). UNESCO on the ground : local perspectives on intangible cultural heritage (M. D. Foster & L. Gilman, Eds.). Indiana University Press.Tsui, P. (2022). Hong Kong heritage : a collection of intangible cultural heritage photography (First edition.). Eastpro Limited.", "recommended_readings": "Cheung, S. C. H., & Chau, H. (2013). International Conference on Foodways and Heritage : a perspective of safeguarding the intangible cultural heritage (S. C. H. Cheung & H. Chau, Eds.). [Hong Kong Heritage Museum].Harrison, R. (2012). Heritage: Critical approaches. London: Routledge.Matsuda, A., & Mengoni, E. (2016). Introduction: Reconsidering cultural heritage in East Asia. In A. Matsuda, & E. Mengoni (Eds.), Reconsidering cultural heritage in East Asia (pp. 31-46). London: Ubiquity Press.", "terms": {"2024-25 Summer Session": {"--LEC (1555)": {"startTimes": ["14:30", "14:30", "14:30", "14:30", "14:30"], "endTimes": ["17:15", "17:15", "17:15", "17:15", "17:15"], "days": [2, 3, 4, 5, 1], "locations": ["Wu Ho Man Yuen Bldg 301", "Wu Ho Man Yuen Bldg 301", "Wu Ho Man Yuen Bldg 301", "Wu Ho Man Yuen Bldg 301", "Wu Ho Man Yuen Bldg 301"], "instructors": ["Dr. FOK Yeung Yeung", "Dr. FOK Yeung Yeung", "Dr. FOK Yeung Yeung", "Dr. FOK Yeung Yeung", "Dr. FOK Yeung Yeung"], "meetingDates": ["25/6", "26/6", "27/6", "2/7", "3/7", "8/7", "9/7", "10/7", "15/7", "16/7", "17/7", "22/7", "23/7", "24/7", "28/7"]}, "-F01-FLD (1556)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Dr. FOK Yeung Yeung"], "meetingDates": ["25/06/2025 - 30/07/2025"]}}}, "assessments": {"Discussion": "20", "Project": "50", "Report": "30"}}, {"code": "1010", "title": "LLMs for Language Studies", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course explores the applications of Large Language Models (LLMs) in language-related disciplines, including linguistics, translation, language learning, and academic writing. Students will gain hands-on experience in utilizing LLMs for research and practical tasks through Python programming. No prior knowledge of programming is required.", "outcome": " Understand the architecture and applications of LLMs. Develop skills to access and fine-tune LLMs for language-related tasks. Evaluate the linguistic and societal implications of LLMs. ", "syllabus": "Week 1: Introduction to Artificial Intelligence and Large Language Models (LLMs)Week 2: Understanding the Architecture and Training of LLMsWeek 3: Python Basics for Accessing LLMsWeek 4: Accessing and Utilizing LLMs with Python (workshop)Week 5: LLMs in Language Learning and TeachingWeek 6: LLMs for Language Assessment and EvaluationWeek 7: LLMs in Translation and InterpretationWeek 8: Using LLMs in pedagogical research and translation/interpreting (workshop)Week 9: LLMs for Linguistic ResearchWeek 10: Using LLMs for Linguistic Research (workshop)Week 11: Cognitive and Neurological Perspectives on LLMsWeek 12: Interpretability for LLMs", "required_readings": "Introduction to LLMs in Python  (Data Camps, free for CUHK students) https://app.datacamp.com/learn/courses/introduction-to-llms-in-python", "recommended_readings": "Rai, D., Zhou, Y., Feng, S., Saparov, A., & Yao, Z. (2024). A practical review of mechanistic interpretability for transformer-based language models. arXiv preprint arXiv:2407.02646.", "terms": {"2025-26 Term 1": {"--LEC (5033)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 712"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}, "-T01-TUT (5034)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [2], "locations": ["William M W Mong Eng Bldg 712"], "instructors": ["Professor CAI Zhenguang"], "meetingDates": ["2/9", "9/9", "16/9", "23/9", "30/9", "14/10", "21/10", "28/10", "4/11", "11/11", "18/11", "25/11"]}}}, "assessments": {"Attendance": "5", "Classwork": "5", "Examination": "30", "Homework or assignment": "20", "Presentation": "10", "Project": "30"}}, {"code": "6000", "title": "Reconnections: Studying China across humanistic disciplines", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Faculty Office of Arts (PG)", "requirements": "", "description": "The state of humanities in academia the world over is in crisis. Part of the crisis is caused by global trends toward financial and technological capitalism, but the other part of the problem has to be sought in the humanistic disciplines themselves. Over-specialization in research, fragmentation among and within disciplines, the pressure of utilitarian goals (such as grant-getting for faculty promotion and practical job-orientation for students) are but some of the manifestations obvious to all. How to remedy the situation? Short of an institutional overhaul, we might begin from our own academic base, humanities departments under the Faculty of Arts.From an academic point of view, over-specialization in the humanities departments results in scholars working in narrow and isolated fields without interaction with colleagues in other departments and fields. The study of China also suffers from such an academic trend, which results in fragmentary studies of narrowly defined topics that fail to connect with each other and with the larger background. A further problem, particularly evident in some humanities fields, is the over-reliance on Western theory, which is applied to Chinese data without reflection or mediation. Certain theoretical excesses, as exemplified in the work of Michel Foucault and other poststructuralist theorists, have led to a general distrust of the human subject itself. Indeed, even the word “humanities” has lost its meaning. This seminar is designed to explore new ways of making “connections” or “reconnections” across various disciplines and theoretical domains, it is broadly-based by design and all-inclusive in content. It is also intended to serve as a general forum for faculty-student discussion so as to provide a stimulus for humanistic scholarship and future research.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "6002", "title": "Advanced Studies in the Humanities", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Faculty Office of Arts (PG)", "requirements": "For students in Research Postgraduate Programmes under Faculty of Arts", "description": "This course provides an opportunity for students to be exposed to current developments in specific areas of the Humanities. The topics vary according to the research expertise of the staff or visiting academics.Course content and format is determined by the instructor(s).Students are allowed to take the above course more than once and gain the units each time they pass the course. However, students cannot take courses with the same course code more than once in a single term.", "outcome": "1. Acquire critical familiarity with the issues discussed.2. Analyze and critically interpret some significant primary texts in the Humanities chosen by the course instructor.", "syllabus": "The syllabus and assessment type may vary according to the teaching staff and the topic selected. Please refer to the course outline for details.", "required_readings": "To be provided by the instructor concerned. The reading list varies depending of the course teacher and the topics selected.", "recommended_readings": "To be provided by the instructor concerned. The reading list varies depending of the course teacher and the topics selected.", "terms": {"2024-25 Term 1": {"--LEC (4422)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Wong Foo Yuan Bldg 107B"], "instructors": ["Ms. IP Ho Sze, \n\nProfessor Harold William NOONAN"], "meetingDates": ["5/9", "12/9", "19/9", "26/9", "3/10", "10/10", "17/10", "24/10", "31/10", "7/11", "14/11", "21/11", "28/11"]}}, "2024-25 Term 2": {"--LEC (4461)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [4], "locations": ["Esther Lee Bldg 204"], "instructors": ["Professor Nicolas James Laurent FERNANDO"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}, "2025-26 Term 1": {"--LEC (2870)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Fung King Hey Bldg 220"], "instructors": ["Staff"], "meetingDates": ["3/9", "10/9", "17/9", "24/9", "8/10", "15/10", "22/10", "5/11", "12/11", "19/11", "26/11"]}}, "2025-26 Term 2": {"--LEC (4505)": {"startTimes": ["14:30"], "endTimes": ["17:15"], "days": [3], "locations": ["Basic Med Sci Bldg Rm2"], "instructors": ["Staff"], "meetingDates": ["7/1", "14/1", "21/1", "28/1", "4/2", "11/2", "25/2", "4/3", "11/3", "18/3", "25/3", "1/4", "8/4", "15/4"]}}}}, {"code": "7001", "title": "Performing Public Humanities", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Faculty Office of Arts (PG)", "requirements": "For students enrolled in Research Postgraduate Programmes in the Faculty of Arts.", "description": "Performing Public Humanities explores the ongoing questions and stakes of cultivating a public-facing humanities today, with a focus on performance as advocacy and action. As such, this course examines public humanities through performance, and simultaneously highlights the work of universities and cultural nonprofits across a variety of contexts, collaborations, and communities. RPg students come together for co-creative research that crisscrosses performance and public human inquiry, with the aim of fostering socially engaged thinking that cuts across disciplinary modes of interrogation.This course does not require prior performing experience or knowledge.", "outcome": "Students who complete this course will be able to: Initiate and lead discussions about cultivating a public-facing humanities today. Examine public human inquiry through multiple understandings and perspectives of performance. Foster and facilitate socially engaged thinking in and across universities and cultural nonprofits.", "syllabus": "I. Contexts “Public humanities”: current approaches, theories, praxes “Performance” as advocacy and action “Social engagement” across disciplines and practices Performing public human inquiry: student-led seminar III. Collaborations Performing public humanities: collaborations and divergence Themed debate, based on assigned readings and prepared case studies focusing on universities and cultural nonprofits Experiential activity: participating and observing an open rehearsal of an LGBTQ+ voice ensemble or another local civic musical group Performing public human inquiry: student-led seminar IIIII. Communities Performing public humanities: communities and individuals Themed debate, based on assigned readings and prepared case studies focusing on universities and cultural nonprofits Experiential activity: co-curating a grassroot outreach program Performing public human inquiry: student-led seminar III", "required_readings": "Bate, Jonathan, ed. 2014. The Public Value of the Humanities. London: Bloomsbury. Conquergood, Dwight. 2013. “Beyond the Text: Toward a Performative Cultural Politics.” In Cultural Struggles: Performance, Ethnography, Praxis (edited and with a critical introduction by E. Patrick Johnson), 47–63. Ann Arbor, MI: University of Michigan Press. Knowles, Ric. 2017. Performing the Intercultural City. Ann Arbor, MI: University of Michigan Press. Kondo, Dorinne. 2018. Worldmaking: Race, Performance, and the Work of Creativity. Durham, NC: Duke University Press. Leonard, Sophia, Benjamin Reiss, Víctor Velázquez Antonio, and Makenzie Renee Fitzgerald. 2020. “Public Humanities in the Reconstructed University.” American Literature 92, no. 4: 781–790. MacLachlan, Heather. 2020. Singing Out: GALA Choruses and Social Change. Ann Arbor, MI: University of Michigan Press. Rai, Shirin M., Milija Gluhovic, Silvija Jestrovic, and Michael Saward, ed. 2021. The Oxford Handbook of Politics and Performance. New York: Oxford University Press. Smulyan, Susan, ed. 2020. Doing Public Humanities. London: Routledge.----------. 2022. “Why Public Humanities?” Daedalus 151, no. 3 (Summer): 124–137.Sommer, Doris. 2014. The Work of Art in the World: Civic Agency and Public Humanities. Durham, NC: Duke University Press.", "recommended_readings": "André, Naomi. 2018. Black Opera: History, Power, Engagement. Champaign, IL: University of Illinois Press. Berkowitz, Carin, and Matthew Gibson. 2022. “Reframing the Public Humanities: The Tensions, Challenges & Potentials of a More Expansive Endeavor.” Daedalus 151, no. 3 (Summer): 68–81. Brooks, Peter, and Hilary Jewett, ed. 2014. The Humanities and Public Life. New York: Fordham University Press. Fauser, Annegret, and Michael A. Figueroa, ed. 2020. Performing Commemoration: Musical Reenactment and the Politics of Trauma. Ann Arbor, MI: University of Michigan Press. Hahn, Tomie. 2021. Arousing Sense: Recipes for Workshopping Sensory Experience. Champaign, IL: University of Illinois Press. Krmpotich, Cara. 2016. “Public Humanities as Third Space: Memory, Meaning-Making and Collections and the Enunciation of ‘We’ in Research.” University of Toronto Quarterly 85, no. 4 (Fall): 82–92. Looser, Diana. 2021. Moving Islands: Contemporary Performance and the Global Pacific. Ann Arbor, MI: University of Michigan Press. Mullen, Mary L. 2016. “Public Humanities’ (Victorian) Culture Problem.” Cultural Studies 30, no. 2: 183–204. Overend, David. 2023. Performance in the Field: Interdisciplinary Practice-as-Research. Cham: Palgrave Macmillan. Schwan, Anne, and Tara Thomson, ed. 2022. The Palgrave Handbook of Digital and Public Humanities. Cham: Palgrave Macmillan.", "terms": {"2024-25 Term 2": {"--LEC (1203)": {"startTimes": ["10:30"], "endTimes": ["13:15"], "days": [4], "locations": ["Esther Lee Bldg 204"], "instructors": ["Professor LIAO Yvonne"], "meetingDates": ["9/1", "16/1", "23/1", "6/2", "13/2", "20/2", "27/2", "6/3", "13/3", "20/3", "27/3", "3/4", "10/4", "17/4"]}}}, "assessments": {"Discussion": "30", "Essays": "20", "Fieldwork or field study": "20", "Participation": "30"}}, {"code": "7002", "title": "Digital Methods for Humanities Research", "career": "Postgraduate - Research", "units": "3.00", "grading": "Graded", "components": "Lecture\nInteractive Tutorial", "campus": "Main Campus", "academic_group": "Faculty Office of Arts (PG)", "requirements": "For students enrolled in Research Postgraduate Programmes in the Faculty of Arts.", "description": "The use of digital methods in research is growing rapidly in many fields in the humanities from China Studies to archaeology. This course introduces students to the exciting world of digital humanities, including text mining (text), digital analysis of images (image), and 3-D scanning and printing (object). These are skills that can be used to gain insights from texts written in Chinese, English and other languages, paintings, engravings or statuary, as well as historical artefacts. Students will be able to apply what they learn in this course to a range of questions in the humanities. It will also be useful in a variety of future careers in both the academic and applied humanities. This is an introductory postgraduate course and no background in digital humanities is required. The class will meet in the Digital Scholarship Lab of the University Library and will culminate in a group project (website) that students can add to their portfolios.", "outcome": " Reflect on the role of digital methods in humanities research Leverage the latest tools developed around the world and the resources available at CUHK for digital humanities research Learn a range of digital methods for humanities research applicable to a variety of fields (word-image-object), including specific computational methods borrowed from data science Apply those methods to specific humanities questions and assess their success Collaborate with other students to create a final project that leverages these methods", "syllabus": " What is Digital Humanities?   Do the Humanities have Data?  Interacting with Computers: Python Made Easy Word: Text Mining with CText I (Chinese) Word: Text Mining with CText II (Chinese) Word: NLP with CText (Chinese & English) Word: More NLP with Python (English & other languages) Image: Image Processing (Filters and Edge Detection) Image: Recognizing Images (Image Analysis) Image: Digital Art History in Action (Giuseppe Castiglione case study)  Object: 3D Scanning  Object: 3D Printing I Object: 3D Printing II Reflections & Final Project Troubleshooting   ", "required_readings": "Mattingly, William. Introduction to Python for Humanists. Boca Raton, FL: CRC Press, 2023. Arnold, Taylor, and Lauren Tilton. Distant Viewing : Computational Exploration of Digital Images. Cambridge, Massachusetts: The MIT Press, 2023. Print.Kumar, L. Jyothish., Pulak M. Pandey, and David Ian. Wimpenny, eds. 3D Printing and Additive Manufacturing Technologies. 1st ed. 2019. Singapore: Springer Singapore, 2019. Print.", "recommended_readings": "Manovich, Lev. Cultural Analytics. Cambridge, MA: MIT Press, 2018. Nyhan, Julianne., and Marco. Passarotti, eds. One Origin of Digital Humanities : Fr Roberto Busa in His Own Words. 1st ed. 2019. Cham: Springer International Publishing, 2019. Print.Guldi, Jo. The Dangerous Art of Text Mining : A Methodology for Digital History. Cambridge: Cambridge University Press, 2023. Sturgeon, Donald. “Chinese Text Project: A Dynamic Digital Library of Premodern Chinese.” Digital Scholarship in the Humanities 36.Supplement_1 (2021): i101–i112. Nature Special Issue, Computational Social Sciences: https://www.nature.com/collections/cadaddgige ", "terms": {"2025-26 Term 2": {"--LEC (2227)": {"startTimes": ["14:30"], "endTimes": ["16:15"], "days": [4], "locations": ["T.C. Cheng Bldg 102"], "instructors": ["Professor Stuart Michael MCMANUS"], "meetingDates": ["8/1", "15/1", "22/1", "29/1", "5/2", "12/2", "26/2", "5/3", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}, "-T01-TUT (2228)": {"startTimes": ["16:30"], "endTimes": ["17:15"], "days": [4], "locations": ["T.C. Cheng Bldg 102"], "instructors": ["Professor Stuart Michael MCMANUS"], "meetingDates": ["8/1", "15/1", "22/1", "29/1", "5/2", "12/2", "26/2", "5/3", "12/3", "19/3", "26/3", "2/4", "9/4", "16/4"]}}}, "assessments": {"Discussion": "20", "Homework or assignment": "20", "Project": "50", "Participation": "10"}}, {"code": "1004", "title": "Introduction to Environmental Humanities: Debates in China", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture", "campus": "Main Campus", "academic_group": "Fac Office of Arts", "requirements": "", "description": "This course introduces to students the emerging field of environmental humanities with a particular focus on China. Human activities have been drastically transforming the ecosystem. How do we in the humanities understand the changing nature, live with pollution, and make sense of ecological deterioration? How do technology, capital and state intertwine and contribute to climate changes and environmental crises? How do people in the humanities engage with issues of sustainability and environmental justice in everyday life? This course introduces major concerns in the field of environmental humanities through the lens of China, the “World’s Factory” and the most populated country with the second largest economy, whose environmental challenges have great implications for the rest of the world. This course will first survey topics of scientific and technological intervention of our natural world in the Anthropocene era. It then looks at case studies of specific topics such as agricultural sustainability, waste management, water crisis, species extinction, and environmental justice. Each topic will contain one week discussion of the topic’s global manifestations and related debates in China, and one week’s introduction on humanities response to the issues. Students will be guided to develop critical understanding of our natural world and to develop innovative ideas and humanistic responses.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]