[{"code": "3000", "title": "Zero to IPO: Introduction to Biomedical Enterprises", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Lecture\nProject", "campus": "Main Campus", "academic_group": "Biotech, Entrep&Healthc Mgt PC", "requirements": "", "description": "This course provides an overview of the full life cycle of biomedical enterprises, from research idea to Initial Public Offering (IPO). Covering broad topics such as company incorporation, financial assessment, licensing, regulatory requirements, and development strategy, students will complete the course well-equipped with the core concepts necessary to work in biomedical business development, management, and venture capital roles.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4000", "title": "Internship", "career": "Undergraduate", "units": "1.00", "grading": "Graded", "components": "Practicum", "campus": "Main Campus", "academic_group": "Biotech, Entrep&Healthc Mgt PC", "requirements": "", "description": "The BEHM4000 Summer Internship Program is designed to provide Year 3 or above BEHM students with practical hands-on experience in the field of Biotechnology, Entrepreneurship, and Healthcare Management. Through this internship, students will have the opportunity to integrate their knowledge and skills acquired in previous courses into real-world settings. They will develop problem-solving abilities, enhance teamwork skills, and gain valuable industry experience to support their career development.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}, {"code": "4001", "title": "Capstone Project I", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Thesis Monitoring Course", "campus": "Main Campus", "academic_group": "Biotech, Entrep&Healthc Mgt PC", "requirements": "", "description": "This course is part I of the capstone project in which students will conduct critical analyses of the existing business models and policies related to the biotechnology industry and healthcare system. It allows students to conduct independent studies related to biotechnology, entrepreneurship and healthcare management. Students will form groups to critically analyze selected companies or policies on healthcare and/or environmental sustainability so that they will be motivated by how these companies, policies, or management strategies are running and their significance in contributing to society. Students will apply knowledge and techniques learned from courses of the relevant concentration areas and conduct a deeper study into specific topics of their interests in biotechnology, entrepreneurship and/or healthcare management. Students and instructors will conduct progress meetings on a regular basis. Students are expected to give oral presentations and submit their reports at the end of the course.", "outcome": "Upon completion of the course, students will be able to: integrate and illustrate understanding: through learning how biotechnology, entrepreneurship and healthcare management intersect, illustrates activities and considerations essential to building a successful business or management strategy; conduct critical analysis: develop skills to evaluate biotech and healthcare models and policies; learn research and independent study skills: gain experience in independent research and data analysis; apply knowledge: to analyze business models or polices related to biotech, entrepreneurship, and healthcare management. discuss from an entrepreneurial perspective: foster innovation and growth by critically evaluating existing models and policies.", "syllabus": "Course SchedulePhase 1: Preparation and Topic Selection (Weeks 1-3)Activities:    Idea generation with outside guests(s) (1-2 hours). Overview of course objectives and expectations. Group formation and role assignment. Selection and approval of topics for analysis.Consultation by Instructors (3 hours):    Confirm group roles and responsibilities. Alignment of topics with course goals. Guidance on research sources. Phase 2: Research and Analysis (Weeks 4-7)Activities:    Conduct research on selected topics/areas. Perform critical analysis using frameworks. Develop initial insights and findings.Consultation by Instructors (3 hours):    Review research progress and identify challenges. Assess the depth of analysis and provide feedback. Discuss insights and their implications for recommendations. Phase 3: Recommendations Development (Weeks 8-11)Activities:    Formulate actionable recommendations based on analysis. Discuss feasibility and alignment with business objectives. Prepare presentation materials summarizing findings. Consultation by Instructors (3 hours) :        Review draft recommendations for improvement. Discuss implementation strategies. Provide feedback on presentation content and clarity. Phase 4: Presentation and Reflection (Weeks 12-14)Activities:    Deliver final presentations to peers and instructors. Reflect on the overall project experience. Submit individual reflection reports on learning outcomes.Consultation by Instructors (2 hours) :  Provide feedback on presentation performance Discuss strengths and areas for improvement. Reflect on teamwork dynamics and project outcomes.", "required_readings": "To be advised by the course coordinator.", "recommended_readings": "To be advised by the course coordinator.", "terms": {"2024-25 Term 2": {"-M01-TMC (9541)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Wing Tak Jack"], "meetingDates": ["06/01/2025 - 14/04/2025"]}}, "2025-26 Term 1": {"-M01-TMC (9058)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Wing Tak Jack"], "meetingDates": ["01/09/2025 - 24/11/2025"]}}, "2025-26 Term 2": {"-M01-TMC (8857)": {"startTimes": ["TBA"], "endTimes": ["TBA"], "days": ["TBA"], "locations": ["No Room Required"], "instructors": ["Professor WONG Wing Tak Jack"], "meetingDates": ["05/01/2026 - 13/04/2026"]}}}, "assessments": {"Presentation": "50", "Report": "50"}}, {"code": "4002", "title": "Capstone Project II", "career": "Undergraduate", "units": "3.00", "grading": "Graded", "components": "Interactive Tutorial", "campus": "Main Campus", "academic_group": "Biotech, Entrep&Healthc Mgt PC", "requirements": "", "description": "This course is part II of the capstone project which is a continuation of the analytical work undertaken by students in the BEHM4001 Capstone Project I, focusing on utilizing research findings to enhance business models and policies within the biotechnology and healthcare sectors. After critically evaluating the companies or policies investigated in Capstone Project I, students should ideate and design a prototype based on the recommendations they developed for optimizing these business practices, improving operational efficiency, and fostering sustainable development. Students are encouraged to test and improve their prototypes, establish their start-ups or NGOs wherever practicable to foster entrepreneurial skills, and provide them with practical experience in developing and implementing strategies, through applying their knowledge and skills acquired from the previous coursework and employing innovative thinking to address real-world challenges. Guidance will be provided by the instructor and regular consultations will ensure the alignment of project objectives. By the end of this course, students will present their proposals through comprehensive oral presentations and provide detailed portfolios, demonstrating their ability to apply theoretical concepts to practical scenarios and contribute meaningfully to biotechnology or healthcare management.", "outcome": "", "syllabus": "", "required_readings": "", "recommended_readings": ""}]